Repository: matb4/eagle
Catalog: lib/l10n/app_*.arb
Languages: ar

source: My Birds
ar: طيوري

source: Bird Details
ar: تفاصيل الطائر

source: Add Bird
ar: إضافة طائر

source: Edit Bird
ar: تعديل بيانات الطائر

source: Analytics
ar: تحليلات الأداء

source: Hood Generator
ar: مولد تصميم البرقع

source: Training Guide
ar: دليل التدريب

# noBirdsAdded
source: No birds have been added yet.
ar: لم يتم إضافة طيور بعد.

# errorOccurred
source: An error occurred: {error}
ar: حدث خطأ: {error}

source: Name
ar: الاسم

# type
source: Type (e.g., Falcon/Eagle)
ar: النوع (مثال: صقر/عقاب)

# initialWeight
source: Initial Weight (grams)
ar: الوزن الأولي (بالجرام)

source: Sex
ar: الجنس

# generalNotes
source: General Notes (Optional)
ar: ملاحظات عامة (اختياري)

# healthRecords
source: Health Records (Optional)
ar: السجل الصحي (اختياري)

# behavioralNotes
source: Behavioral Notes (Optional)
ar: ملاحظات سلوكية (اختياري)

# addBirdButton
source: Add Bird
ar: إضافة الطائر

# editBirdButton
source: Save Changes
ar: حفظ التعديلات

source: Select Image
ar: اختيار صورة

source: Change Image
ar: تغيير الصورة

# pleaseEnterName
source: Please enter a name
ar: الرجاء إدخال الاسم

# pleaseEnterType
source: Please enter a type
ar: الرجاء إدخال النوع

# pleaseEnterWeight
source: Please enter a weight
ar: الرجاء إدخال الوزن

# pleaseEnterSex
source: Please enter the sex
ar: الرجاء إدخال الجنس
